#include "All.h"

//实现各种中断服务函数的源文件

///********************************************
//@功能:串口2接收中断
//@说明:
//@参数: 无
//@返回值: 无
//*********************************************/
//void USART2_IRQHandler(void)   
//{                      
//	if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET){  //如果USART_IT_RXNE标志置位，表示有数据到了，进入if分支
//		if(USART2->DR){                                     //非零值才保存到缓冲区	
//			Usart2_RxBuff[Usart2_RxCounter]=USART2->DR;     //保存到缓冲区	
//			Usart2_RxCounter ++;                            //每接收1个字节的数据，Usart2_RxCounter加1，表示接收的数据总量+1 
//		}		
//	}
//} 
/********************************************
@功能:不可屏蔽中断处理函数
@说明:
@参数: 无
@返回值: 无
*********************************************/
void NMI_Handler(void)
{
}
/********************************************
@功能:硬件出错后进入的中断处理函数
@说明:
@参数: 无
@返回值: 无
*********************************************/
void HardFault_Handler(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}
/********************************************
@功能:内存管理中断处理函数
@说明:
@参数: 无
@返回值: 无
*********************************************/
void MemManage_Handler(void)
{
  /* Go to infinite loop when Memory Manage exception occurs */
  while (1)
  {
  }
}
/********************************************
@功能:预取指失败，存储器访问失败中断处理函数 
@说明:
@参数: 无
@返回值: 无
*********************************************/
void BusFault_Handler(void)
{
  /* Go to infinite loop when Bus Fault exception occurs */
  while (1)
  {
  }
}
/********************************************
@功能:未定义的指令或非法状态处理函数 
@说明:
@参数: 无
@返回值: 无
*********************************************/
void UsageFault_Handler(void)
{
  /* Go to infinite loop when Usage Fault exception occurs */
  while (1)
  {
  }
}
/********************************************
@功能:软中断，SWI 指令调用的处理函数 
@说明:
@参数: 无
@返回值: 无
*********************************************/
void SVC_Handler(void)
{
}
/********************************************
@功能:调试监控器处理函数    
@说明:
@参数: 无
@返回值: 无
*********************************************/
void DebugMon_Handler(void)
{
}
/********************************************
@功能:可挂起的系统服务处理函数   
@说明:
@参数: 无
@返回值: 无
*********************************************/
void PendSV_Handler(void)
{
}
/********************************************
@功能:SysTic系统嘀嗒定时器处理函数  
@说明:
@参数: 无
@返回值: 无
*********************************************/
void SysTick_Handler(void)
{
}
